{"keras_version": "2.0.4", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "name": "conv2d_1", "strides": [1, 1], "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "batch_input_shape": [null, 28, 28, 1], "kernel_constraint": null, "padding": "valid", "trainable": true, "kernel_size": [3, 3], "dtype": "float32", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "name": "conv2d_2", "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "valid", "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "name": "conv2d_3", "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "padding": "valid", "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2], "padding": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "name": "conv2d_4", "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 8, "padding": "valid", "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "units": 72, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "use_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.3, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "units": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "softmax", "trainable": true}}], "backend": "tensorflow"}